{"format": "graph-model", "generatedBy": "2.16.1", "convertedBy": "TensorFlow.js Converter v4.19.0", "signature": {"inputs": {"X": {"name": "X:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "784"}]}}}, "outputs": {"accuracy_calc/prediction": {"name": "accuracy_calc/prediction:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}}}, "modelTopology": {"node": [{"name": "dropout_layer/GreaterEqual/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "X", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "784"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "layer_1/W", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}, {"size": "512"}]}}}}}, {"name": "out/B", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "layer_1/B", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "dropout_layer/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dropout_layer/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "layer_2/W", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "64"}]}}}}}, {"name": "layer_2/B", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "accuracy_calc/prediction/dimension", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "out/W", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "10"}]}}}}}, {"name": "layer_1/Relu", "op": "_FusedMatMul", "input": ["X", "layer_1/W", "layer_1/B"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "dropout_layer/Shape", "op": "Shape", "input": ["layer_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "dropout_layer/Mul", "op": "Mul", "input": ["layer_1/Relu", "dropout_layer/Const"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_layer/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["dropout_layer/Shape"], "attr": {"dtype": {"type": "DT_FLOAT"}, "seed": {"i": "0"}, "T": {"type": "DT_INT32"}, "seed2": {"i": "0"}}}, {"name": "dropout_layer/GreaterEqual", "op": "GreaterEqual", "input": ["dropout_layer/random_uniform/RandomUniform", "dropout_layer/GreaterEqual/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_layer/SelectV2", "op": "SelectV2", "input": ["dropout_layer/GreaterEqual", "dropout_layer/Mul", "dropout_layer/Const_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "layer_2/Relu", "op": "_FusedMatMul", "input": ["dropout_layer/SelectV2", "layer_2/W", "layer_2/B"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "out/add", "op": "_FusedMatMul", "input": ["layer_2/Relu", "out/W", "out/B"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "out/Softmax", "op": "Softmax", "input": ["out/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "accuracy_calc/prediction", "op": "ArgMax", "input": ["out/Softmax", "accuracy_calc/prediction/dimension"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "output_type": {"type": "DT_INT64"}}}], "library": {}, "versions": {"producer": 1766}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dropout_layer/GreaterEqual/y", "shape": [], "dtype": "float32"}, {"name": "layer_1/W", "shape": [784, 512], "dtype": "float32"}, {"name": "out/B", "shape": [10], "dtype": "float32"}, {"name": "layer_1/B", "shape": [512], "dtype": "float32"}, {"name": "dropout_layer/Const", "shape": [], "dtype": "float32"}, {"name": "dropout_layer/Const_1", "shape": [], "dtype": "float32"}, {"name": "layer_2/W", "shape": [512, 64], "dtype": "float32"}, {"name": "layer_2/B", "shape": [64], "dtype": "float32"}, {"name": "accuracy_calc/prediction/dimension", "shape": [], "dtype": "int32"}, {"name": "out/W", "shape": [64, 10], "dtype": "float32"}]}]}